[
  {
    "year": "2021",
    "title": "Computer Technician",
    "description": "This year, I graduated as a Computer Technician, where I first honed my skills as a developer in technologies like Visual Basic and .NET databases like SQLServer"
  },
  {
    "year": "2022",
    "title": "UTN FRSN - Superior Technician in Programming",
    "description": "This year, I started university in this program, where I've learned everything from the basics of C++ to creating REST APIs with ASP .Net in C# using SQL Server and Frontend with React."
  },
  {
    "year": "2023",
    "title": "Course 'Learn to Program' 2023",
    "description": "In this government course, I was able to apply what I learned in university about web design to develop various websites in a different context, which helped me pass the course. I graduated as a 'Junior Web Developer' in June of this year."
  },
  {
    "year": "2024",
    "title": "Course 'I Can Program' - Junior Achievement",
    "description": "This course, like the previous one, allowed me to put my frontend knowledge into action by creating websites with vanilla JavaScript. I graduated once again as a 'Junior Web Developer'."
  },
  {
    "year": "2024",
    "title": "Ecommerce for 'Padel Point'",
    "description": "This is my first experience in a real-world environment. In this case, I was hired by a client to create an e-commerce platform for their sports product business. I developed the backend of a full-stack project while a colleague handled the frontend. We used essential technologies such as Next.js for the client-side and Nest.js for the backend, along with cloud services like OAuth clients, database deployment, and more."
  },
  {
    "year": "2025",
    "title": "Freelancing with Wordrpess",
    "description": "This was my first remote experience working for an international client. I was hired by a startup based in Spain to develop websites as a freelance WordPress developer. Using templates, I built course sales pages, landing pages, and business websites with WooCommerce integration, among others."
  },
  {
    "year": "2025",
    "title": "Codescript | Fullstack developer",
  "description": "My first opportunity to be part of a fully remote company. I worked on the backend, developing as a team an application for a logistics company in Mexico. We developed an API with a microservices structure applying Domain Driven Design and CQRS (Command Query Responsibility Segregation) with Nest.js, web sockets, RabbitMQ, OpenTelemetry, etc. Using the SCRUM methodology in Azure DevOps."
  }
]
